ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DD14def.inc
.equ CPU_CCP = 0x0034                    ; Configuration Change Protection
.equ CPU_SP = 0x003D                     ; Stack Pointer
.equ CPU_SPL = 0x003D                    ; Stack Pointer low byte
.equ CPU_SPH = 0x003E                    ; Stack Pointer hi byte
.equ CPU_SREG = 0x003F                   ; Status Register

;*************************************************************************
;** CPUINT - Interrupt Controller
;*************************************************************************

.equ CPUINT_CTRLA = 0x0110               ; Control A
.equ CPUINT_STATUS = 0x0111              ; Status
.equ CPUINT_LVL0PRI = 0x0112             ; Interrupt Level 0 Priority
.equ CPUINT_LVL1VEC = 0x0113             ; Interrupt Level 1 Priority Vector

;*************************************************************************
;** CRCSCAN - CRCSCAN
;*************************************************************************

.equ CRCSCAN_CTRLA = 0x0120              ; Control A
.equ CRCSCAN_CTRLB = 0x0121              ; Control B
.equ CRCSCAN_STATUS = 0x0122             ; Status

;*************************************************************************
;** DAC0 - Digital to Analog Converter
;*************************************************************************

.equ DAC0_CTRLA = 0x06A0                 ; Control Register A
.equ DAC0_DATA = 0x06A2                  ; DATA Register
.equ DAC0_DATAL = 0x06A2                 ; DATA Register low byte
.equ DAC0_DATAH = 0x06A3                 ; DATA Register hi byte

;*************************************************************************
;** EVSYS - Event System
;*************************************************************************

.equ EVSYS_SWEVENTA = 0x0200             ; Software Event A
.equ EVSYS_SWEVENTB = 0x0201             ; Software Event B
.equ EVSYS_CHANNEL0 = 0x0210             ; Multiplexer Channel 0
.equ EVSYS_CHANNEL1 = 0x0211             ; Multiplexer Channel 1
.equ EVSYS_CHANNEL2 = 0x0212             ; Multiplexer Channel 2
.equ EVSYS_CHANNEL3 = 0x0213             ; Multiplexer Channel 3
.equ EVSYS_CHANNEL4 = 0x0214             ; Multiplexer Channel 4
.equ EVSYS_CHANNEL5 = 0x0215             ; Multiplexer Channel 5
.equ EVSYS_USERCCLLUT0A = 0x0220         ; User 0 - CCL0 Event A
.equ EVSYS_USERCCLLUT0B = 0x0221         ; User 1 - CCL0 Event B
.equ EVSYS_USERCCLLUT1A = 0x0222         ; User 2 - CCL1 Event A
.equ EVSYS_USERCCLLUT1B = 0x0223         ; User 3 - CCL1 Event B
.equ EVSYS_USERCCLLUT2A = 0x0224         ; User 4 - CCL2 Event A
.equ EVSYS_USERCCLLUT2B = 0x0225         ; User 5 - CCL2 Event B
.equ EVSYS_USERCCLLUT3A = 0x0226         ; User 6 - CCL3 Event A
.equ EVSYS_USERCCLLUT3B = 0x0227         ; User 7 - CCL3 Event B
.equ EVSYS_USERADC0START = 0x0228        ; User 12 - ADC0
.equ EVSYS_USEREVSYSEVOUTA = 0x0229      ; User 13 - EVOUTA
.equ EVSYS_USEREVSYSEVOUTC = 0x022A      ; User 15 - EVOUTC
.equ EVSYS_USEREVSYSEVOUTD = 0x022B      ; User 16 - EVOUTD
.equ EVSYS_USEREVSYSEVOUTF = 0x022C      ; User 18 - EVOUTF
.equ EVSYS_USERUSART0IRDA = 0x022D       ; User 20 - USART0
.equ EVSYS_USERUSART1IRDA = 0x022E       ; User 21 - USART1
.equ EVSYS_USERTCA0CNTA = 0x022F         ; User 26 - TCA0 Event A
.equ EVSYS_USERTCA0CNTB = 0x0230         ; User 27 - TCA0 Event B
.equ EVSYS_USERTCB0CAPT = 0x0231         ; User 30 - TCB0 Event A
.equ EVSYS_USERTCB0COUNT = 0x0232        ; User 31 - TCB0 Event B
.equ EVSYS_USERTCB1CAPT = 0x0233         ; User 32 - TCB1 Event A
.equ EVSYS_USERTCB1COUNT = 0x0234        ; User 33 - TCB1 Event B
.equ EVSYS_USERTCB2CAPT = 0x0235         ; User 34 - TCB2 Event A
.equ EVSYS_USERTCB2COUNT = 0x0236        ; User 35 - TCB2 Event B
.equ EVSYS_USERTCD0INPUTA = 0x0237       ; User 40 - TCD0 Event A
.equ EVSYS_USERTCD0INPUTB = 0x0238       ; User 41 - TCD0 Event B

;*************************************************************************
;** FUSE - Fuses
;*************************************************************************

.equ FUSE_WDTCFG = 0x1050                ; Watchdog Configuration
.equ FUSE_BODCFG = 0x1051                ; BOD Configuration
.equ FUSE_OSCCFG = 0x1052                ; Oscillator Configuration
.equ FUSE_SYSCFG0 = 0x1055               ; System Configuration 0
.equ FUSE_SYSCFG1 = 0x1056               ; System Configuration 1
.equ FUSE_CODESIZE = 0x1057              ; Code Section Size
.equ FUSE_BOOTSIZE = 0x1058              ; Boot Section Size

;*************************************************************************
;** GPR - General Purpose Registers
;*************************************************************************

.equ GPR_GPR0 = 0x001C                   ; General Purpose Register 0
.equ GPR_GPR1 = 0x001D                   ; General Purpose Register 1
.equ GPR_GPR2 = 0x001E                   ; General Purpose Register 2
.equ GPR_GPR3 = 0x001F                   ; General Purpose Register 3

;*************************************************************************
;** LOCK - Lockbits
;*************************************************************************

.equ LOCK_KEY = 0x1040                   ; Lock Key Bits
.equ LOCK_KEY0 = 0x1040                  ; Lock Key Bits 0
.equ LOCK_KEY1 = 0x1041                  ; Lock Key Bits 1
.equ LOCK_KEY2 = 0x1042                  ; Lock Key Bits 2
.equ LOCK_KEY3 = 0x1043                  ; Lock Key Bits 3

;*************************************************************************
;** MVIO - Multi-Voltage I/O
;*************************************************************************

.equ MVIO_INTCTRL = 0x00C0               ; Interrupt Control
.equ MVIO_INTFLAGS = 0x00C1              ; Interrupt Flags
.equ MVIO_STATUS = 0x00C2                ; Status

;*************************************************************************
;** NVMCTRL - Non-volatile Memory Controller
;*************************************************************************

.equ NVMCTRL_CTRLA = 0x1000              ; Control A
.equ NVMCTRL_CTRLB = 0x1001              ; Control B
.equ NVMCTRL_STATUS = 0x1002             ; Status
.equ NVMCTRL_INTCTRL = 0x1003            ; Interrupt Control
.equ NVMCTRL_INTFLAGS = 0x1004           ; Interrupt Flags
.equ NVMCTRL_DATA = 0x1006               ; Data
.equ NVMCTRL_DATAL = 0x1006              ; Data low byte
.equ NVMCTRL_DATAH = 0x1007              ; Data hi byte
.equ NVMCTRL_ADDR = 0x1008               ; Address
.equ NVMCTRL_ADDR0 = 0x1008              ; Address 0
.equ NVMCTRL_ADDR1 = 0x1009              ; Address 1
.equ NVMCTRL_ADDR2 = 0x100A              ; Address 2
.equ NVMCTRL_ADDR3 = 0x100B              ; Address 3

;*************************************************************************
;** PORTA - I/O Ports
;*************************************************************************

