ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DD14def.inc
; DAC_CTRLA masks
.equ DAC_ENABLE_bm = 0x01                ; DAC Enable bit mask
.equ DAC_ENABLE_bp = 0                   ; DAC Enable bit position
.equ DAC_OUTEN_bm = 0x40                 ; Output Buffer Enable bit mask
.equ DAC_OUTEN_bp = 6                    ; Output Buffer Enable bit position
.equ DAC_RUNSTDBY_bm = 0x80              ; Run in Standby Mode bit mask
.equ DAC_RUNSTDBY_bp = 7                 ; Run in Standby Mode bit position

; DAC_DATA masks
.equ DAC_DATA_gm = 0xFFC0                ; Data group mask
.equ DAC_DATA_gp = 6                     ; Data group position
.equ DAC_DATA_0_bm = (1<<6)              ; Data bit 0 mask
.equ DAC_DATA_0_bp = 6                   ; Data bit 0 position
.equ DAC_DATA_1_bm = (1<<7)              ; Data bit 1 mask
.equ DAC_DATA_1_bp = 7                   ; Data bit 1 position
.equ DAC_DATA_2_bm = (1<<8)              ; Data bit 2 mask
.equ DAC_DATA_2_bp = 8                   ; Data bit 2 position
.equ DAC_DATA_3_bm = (1<<9)              ; Data bit 3 mask
.equ DAC_DATA_3_bp = 9                   ; Data bit 3 position
.equ DAC_DATA_4_bm = (1<<10)             ; Data bit 4 mask
.equ DAC_DATA_4_bp = 10                  ; Data bit 4 position
.equ DAC_DATA_5_bm = (1<<11)             ; Data bit 5 mask
.equ DAC_DATA_5_bp = 11                  ; Data bit 5 position
.equ DAC_DATA_6_bm = (1<<12)             ; Data bit 6 mask
.equ DAC_DATA_6_bp = 12                  ; Data bit 6 position
.equ DAC_DATA_7_bm = (1<<13)             ; Data bit 7 mask
.equ DAC_DATA_7_bp = 13                  ; Data bit 7 position
.equ DAC_DATA_8_bm = (1<<14)             ; Data bit 8 mask
.equ DAC_DATA_8_bp = 14                  ; Data bit 8 position
.equ DAC_DATA_9_bm = (1<<15)             ; Data bit 9 mask
.equ DAC_DATA_9_bp = 15                  ; Data bit 9 position


;*************************************************************************
;** EVSYS - Event System
;*************************************************************************

; EVSYS_SWEVENTA masks
.equ EVSYS_SWEVENTA_gm = 0xFF            ; Software event on channel select group mask
.equ EVSYS_SWEVENTA_gp = 0               ; Software event on channel select group position
.equ EVSYS_SWEVENTA_0_bm = (1<<0)        ; Software event on channel select bit 0 mask
.equ EVSYS_SWEVENTA_0_bp = 0             ; Software event on channel select bit 0 position
.equ EVSYS_SWEVENTA_1_bm = (1<<1)        ; Software event on channel select bit 1 mask
.equ EVSYS_SWEVENTA_1_bp = 1             ; Software event on channel select bit 1 position
.equ EVSYS_SWEVENTA_2_bm = (1<<2)        ; Software event on channel select bit 2 mask
.equ EVSYS_SWEVENTA_2_bp = 2             ; Software event on channel select bit 2 position
.equ EVSYS_SWEVENTA_3_bm = (1<<3)        ; Software event on channel select bit 3 mask
.equ EVSYS_SWEVENTA_3_bp = 3             ; Software event on channel select bit 3 position
.equ EVSYS_SWEVENTA_4_bm = (1<<4)        ; Software event on channel select bit 4 mask
.equ EVSYS_SWEVENTA_4_bp = 4             ; Software event on channel select bit 4 position
.equ EVSYS_SWEVENTA_5_bm = (1<<5)        ; Software event on channel select bit 5 mask
.equ EVSYS_SWEVENTA_5_bp = 5             ; Software event on channel select bit 5 position
.equ EVSYS_SWEVENTA_6_bm = (1<<6)        ; Software event on channel select bit 6 mask
.equ EVSYS_SWEVENTA_6_bp = 6             ; Software event on channel select bit 6 position
.equ EVSYS_SWEVENTA_7_bm = (1<<7)        ; Software event on channel select bit 7 mask
.equ EVSYS_SWEVENTA_7_bp = 7             ; Software event on channel select bit 7 position

; EVSYS_SWEVENTB masks
.equ EVSYS_SWEVENTB_gm = 0x03            ; Software event on channel select group mask
.equ EVSYS_SWEVENTB_gp = 0               ; Software event on channel select group position
.equ EVSYS_SWEVENTB_0_bm = (1<<0)        ; Software event on channel select bit 0 mask
.equ EVSYS_SWEVENTB_0_bp = 0             ; Software event on channel select bit 0 position
.equ EVSYS_SWEVENTB_1_bm = (1<<1)        ; Software event on channel select bit 1 mask
.equ EVSYS_SWEVENTB_1_bp = 1             ; Software event on channel select bit 1 position

; EVSYS_CHANNEL0 masks
.equ EVSYS_CHANNEL0_gm = 0xFF            ; Channel 0 generator select group mask
.equ EVSYS_CHANNEL0_gp = 0               ; Channel 0 generator select group position
.equ EVSYS_CHANNEL0_0_bm = (1<<0)        ; Channel 0 generator select bit 0 mask
.equ EVSYS_CHANNEL0_0_bp = 0             ; Channel 0 generator select bit 0 position
.equ EVSYS_CHANNEL0_1_bm = (1<<1)        ; Channel 0 generator select bit 1 mask
.equ EVSYS_CHANNEL0_1_bp = 1             ; Channel 0 generator select bit 1 position
.equ EVSYS_CHANNEL0_2_bm = (1<<2)        ; Channel 0 generator select bit 2 mask
.equ EVSYS_CHANNEL0_2_bp = 2             ; Channel 0 generator select bit 2 position
.equ EVSYS_CHANNEL0_3_bm = (1<<3)        ; Channel 0 generator select bit 3 mask
.equ EVSYS_CHANNEL0_3_bp = 3             ; Channel 0 generator select bit 3 position
.equ EVSYS_CHANNEL0_4_bm = (1<<4)        ; Channel 0 generator select bit 4 mask
.equ EVSYS_CHANNEL0_4_bp = 4             ; Channel 0 generator select bit 4 position
.equ EVSYS_CHANNEL0_5_bm = (1<<5)        ; Channel 0 generator select bit 5 mask
.equ EVSYS_CHANNEL0_5_bp = 5             ; Channel 0 generator select bit 5 position
.equ EVSYS_CHANNEL0_6_bm = (1<<6)        ; Channel 0 generator select bit 6 mask
.equ EVSYS_CHANNEL0_6_bp = 6             ; Channel 0 generator select bit 6 position
.equ EVSYS_CHANNEL0_7_bm = (1<<7)        ; Channel 0 generator select bit 7 mask
.equ EVSYS_CHANNEL0_7_bp = 7             ; Channel 0 generator select bit 7 position

; EVSYS_CHANNEL1 masks
.equ EVSYS_CHANNEL1_gm = 0xFF            ; Channel 1 generator select group mask
.equ EVSYS_CHANNEL1_gp = 0               ; Channel 1 generator select group position
.equ EVSYS_CHANNEL1_0_bm = (1<<0)        ; Channel 1 generator select bit 0 mask
.equ EVSYS_CHANNEL1_0_bp = 0             ; Channel 1 generator select bit 0 position
.equ EVSYS_CHANNEL1_1_bm = (1<<1)        ; Channel 1 generator select bit 1 mask
.equ EVSYS_CHANNEL1_1_bp = 1             ; Channel 1 generator select bit 1 position
.equ EVSYS_CHANNEL1_2_bm = (1<<2)        ; Channel 1 generator select bit 2 mask
.equ EVSYS_CHANNEL1_2_bp = 2             ; Channel 1 generator select bit 2 position
.equ EVSYS_CHANNEL1_3_bm = (1<<3)        ; Channel 1 generator select bit 3 mask
.equ EVSYS_CHANNEL1_3_bp = 3             ; Channel 1 generator select bit 3 position
.equ EVSYS_CHANNEL1_4_bm = (1<<4)        ; Channel 1 generator select bit 4 mask
.equ EVSYS_CHANNEL1_4_bp = 4             ; Channel 1 generator select bit 4 position
.equ EVSYS_CHANNEL1_5_bm = (1<<5)        ; Channel 1 generator select bit 5 mask
.equ EVSYS_CHANNEL1_5_bp = 5             ; Channel 1 generator select bit 5 position
.equ EVSYS_CHANNEL1_6_bm = (1<<6)        ; Channel 1 generator select bit 6 mask
.equ EVSYS_CHANNEL1_6_bp = 6             ; Channel 1 generator select bit 6 position
.equ EVSYS_CHANNEL1_7_bm = (1<<7)        ; Channel 1 generator select bit 7 mask
.equ EVSYS_CHANNEL1_7_bp = 7             ; Channel 1 generator select bit 7 position

; EVSYS_CHANNEL2 masks
.equ EVSYS_CHANNEL2_gm = 0xFF            ; Channel 2 generator select group mask
.equ EVSYS_CHANNEL2_gp = 0               ; Channel 2 generator select group position
.equ EVSYS_CHANNEL2_0_bm = (1<<0)        ; Channel 2 generator select bit 0 mask
.equ EVSYS_CHANNEL2_0_bp = 0             ; Channel 2 generator select bit 0 position
.equ EVSYS_CHANNEL2_1_bm = (1<<1)        ; Channel 2 generator select bit 1 mask
.equ EVSYS_CHANNEL2_1_bp = 1             ; Channel 2 generator select bit 1 position
.equ EVSYS_CHANNEL2_2_bm = (1<<2)        ; Channel 2 generator select bit 2 mask
.equ EVSYS_CHANNEL2_2_bp = 2             ; Channel 2 generator select bit 2 position
.equ EVSYS_CHANNEL2_3_bm = (1<<3)        ; Channel 2 generator select bit 3 mask
.equ EVSYS_CHANNEL2_3_bp = 3             ; Channel 2 generator select bit 3 position
.equ EVSYS_CHANNEL2_4_bm = (1<<4)        ; Channel 2 generator select bit 4 mask
.equ EVSYS_CHANNEL2_4_bp = 4             ; Channel 2 generator select bit 4 position
.equ EVSYS_CHANNEL2_5_bm = (1<<5)        ; Channel 2 generator select bit 5 mask
.equ EVSYS_CHANNEL2_5_bp = 5             ; Channel 2 generator select bit 5 position
.equ EVSYS_CHANNEL2_6_bm = (1<<6)        ; Channel 2 generator select bit 6 mask
.equ EVSYS_CHANNEL2_6_bp = 6             ; Channel 2 generator select bit 6 position
.equ EVSYS_CHANNEL2_7_bm = (1<<7)        ; Channel 2 generator select bit 7 mask
.equ EVSYS_CHANNEL2_7_bp = 7             ; Channel 2 generator select bit 7 position

; EVSYS_CHANNEL3 masks
.equ EVSYS_CHANNEL3_gm = 0xFF            ; Channel 3 generator select group mask
.equ EVSYS_CHANNEL3_gp = 0               ; Channel 3 generator select group position
.equ EVSYS_CHANNEL3_0_bm = (1<<0)        ; Channel 3 generator select bit 0 mask
.equ EVSYS_CHANNEL3_0_bp = 0             ; Channel 3 generator select bit 0 position
.equ EVSYS_CHANNEL3_1_bm = (1<<1)        ; Channel 3 generator select bit 1 mask
.equ EVSYS_CHANNEL3_1_bp = 1             ; Channel 3 generator select bit 1 position
.equ EVSYS_CHANNEL3_2_bm = (1<<2)        ; Channel 3 generator select bit 2 mask
.equ EVSYS_CHANNEL3_2_bp = 2             ; Channel 3 generator select bit 2 position
.equ EVSYS_CHANNEL3_3_bm = (1<<3)        ; Channel 3 generator select bit 3 mask
.equ EVSYS_CHANNEL3_3_bp = 3             ; Channel 3 generator select bit 3 position
.equ EVSYS_CHANNEL3_4_bm = (1<<4)        ; Channel 3 generator select bit 4 mask
.equ EVSYS_CHANNEL3_4_bp = 4             ; Channel 3 generator select bit 4 position
.equ EVSYS_CHANNEL3_5_bm = (1<<5)        ; Channel 3 generator select bit 5 mask
.equ EVSYS_CHANNEL3_5_bp = 5             ; Channel 3 generator select bit 5 position
.equ EVSYS_CHANNEL3_6_bm = (1<<6)        ; Channel 3 generator select bit 6 mask
.equ EVSYS_CHANNEL3_6_bp = 6             ; Channel 3 generator select bit 6 position
.equ EVSYS_CHANNEL3_7_bm = (1<<7)        ; Channel 3 generator select bit 7 mask
.equ EVSYS_CHANNEL3_7_bp = 7             ; Channel 3 generator select bit 7 position

