ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DD14def.inc
; TCD_DLYVAL masks
.equ TCD_DLYVAL_gm = 0xFF                ; Delay value group mask
.equ TCD_DLYVAL_gp = 0                   ; Delay value group position
.equ TCD_DLYVAL_0_bm = (1<<0)            ; Delay value bit 0 mask
.equ TCD_DLYVAL_0_bp = 0                 ; Delay value bit 0 position
.equ TCD_DLYVAL_1_bm = (1<<1)            ; Delay value bit 1 mask
.equ TCD_DLYVAL_1_bp = 1                 ; Delay value bit 1 position
.equ TCD_DLYVAL_2_bm = (1<<2)            ; Delay value bit 2 mask
.equ TCD_DLYVAL_2_bp = 2                 ; Delay value bit 2 position
.equ TCD_DLYVAL_3_bm = (1<<3)            ; Delay value bit 3 mask
.equ TCD_DLYVAL_3_bp = 3                 ; Delay value bit 3 position
.equ TCD_DLYVAL_4_bm = (1<<4)            ; Delay value bit 4 mask
.equ TCD_DLYVAL_4_bp = 4                 ; Delay value bit 4 position
.equ TCD_DLYVAL_5_bm = (1<<5)            ; Delay value bit 5 mask
.equ TCD_DLYVAL_5_bp = 5                 ; Delay value bit 5 position
.equ TCD_DLYVAL_6_bm = (1<<6)            ; Delay value bit 6 mask
.equ TCD_DLYVAL_6_bp = 6                 ; Delay value bit 6 position
.equ TCD_DLYVAL_7_bm = (1<<7)            ; Delay value bit 7 mask
.equ TCD_DLYVAL_7_bp = 7                 ; Delay value bit 7 position

; TCD_DITCTRL masks
.equ TCD_DITHERSEL_gm = 0x03             ; Dither select group mask
.equ TCD_DITHERSEL_gp = 0                ; Dither select group position
.equ TCD_DITHERSEL_0_bm = (1<<0)         ; Dither select bit 0 mask
.equ TCD_DITHERSEL_0_bp = 0              ; Dither select bit 0 position
.equ TCD_DITHERSEL_1_bm = (1<<1)         ; Dither select bit 1 mask
.equ TCD_DITHERSEL_1_bp = 1              ; Dither select bit 1 position

; TCD_DITVAL masks
.equ TCD_DITHER_gm = 0x0F                ; Dither value group mask
.equ TCD_DITHER_gp = 0                   ; Dither value group position
.equ TCD_DITHER_0_bm = (1<<0)            ; Dither value bit 0 mask
.equ TCD_DITHER_0_bp = 0                 ; Dither value bit 0 position
.equ TCD_DITHER_1_bm = (1<<1)            ; Dither value bit 1 mask
.equ TCD_DITHER_1_bp = 1                 ; Dither value bit 1 position
.equ TCD_DITHER_2_bm = (1<<2)            ; Dither value bit 2 mask
.equ TCD_DITHER_2_bp = 2                 ; Dither value bit 2 position
.equ TCD_DITHER_3_bm = (1<<3)            ; Dither value bit 3 mask
.equ TCD_DITHER_3_bp = 3                 ; Dither value bit 3 position

; TCD_DBGCTRL masks
.equ TCD_DBGRUN_bm = 0x01                ; Debug run bit mask
.equ TCD_DBGRUN_bp = 0                   ; Debug run bit position
.equ TCD_FAULTDET_bm = 0x04              ; Fault detection bit mask
.equ TCD_FAULTDET_bp = 2                 ; Fault detection bit position

; Clock select
.equ TCD_CLKSEL_OSCHF_gc = (0x00<<5)     ; Internal High-Frequency oscillator
.equ TCD_CLKSEL_PLL_gc = (0x01<<5)       ; PLL
.equ TCD_CLKSEL_EXTCLK_gc = (0x02<<5)    ; External Clock
.equ TCD_CLKSEL_CLKPER_gc = (0x03<<5)    ; Peripheral clock

; Counter prescaler select
.equ TCD_CNTPRES_DIV1_gc = (0x00<<3)     ; Sync clock divided by 1
.equ TCD_CNTPRES_DIV4_gc = (0x01<<3)     ; Sync clock divided by 4
.equ TCD_CNTPRES_DIV32_gc = (0x02<<3)    ; Sync clock divided by 32

; Synchronization prescaler select
.equ TCD_SYNCPRES_DIV1_gc = (0x00<<1)    ; Selected clock source divided by 1
.equ TCD_SYNCPRES_DIV2_gc = (0x01<<1)    ; Selected clock source divided by 2
.equ TCD_SYNCPRES_DIV4_gc = (0x02<<1)    ; Selected clock source divided by 4
.equ TCD_SYNCPRES_DIV8_gc = (0x03<<1)    ; Selected clock source divided by 8

; Waveform generation mode select
.equ TCD_WGMODE_ONERAMP_gc = (0x00<<0)   ; One ramp mode
.equ TCD_WGMODE_TWORAMP_gc = (0x01<<0)   ; Two ramp mode
.equ TCD_WGMODE_FOURRAMP_gc = (0x02<<0)  ; Four ramp mode
.equ TCD_WGMODE_DS_gc = (0x03<<0)        ; Dual slope mode

; Compare C output select
.equ TCD_CMPCSEL_PWMA_gc = (0x00<<6)     ; PWM A output
.equ TCD_CMPCSEL_PWMB_gc = (0x01<<6)     ; PWM B output

; Compare D output select
.equ TCD_CMPDSEL_PWMA_gc = (0x00<<7)     ; PWM A output
.equ TCD_CMPDSEL_PWMB_gc = (0x01<<7)     ; PWM B output

; Dither select
.equ TCD_DITHERSEL_ONTIMEB_gc = (0x00<<0) ; On-time ramp B
.equ TCD_DITHERSEL_ONTIMEAB_gc = (0x01<<0) ; On-time ramp A and B
.equ TCD_DITHERSEL_DEADTIMEB_gc = (0x02<<0) ; Dead-time rampB
.equ TCD_DITHERSEL_DEADTIMEAB_gc = (0x03<<0) ; Dead-time ramp A and B

; Delay prescaler select
.equ TCD_DLYPRESC_DIV1_gc = (0x00<<4)    ; No prescaling
.equ TCD_DLYPRESC_DIV2_gc = (0x01<<4)    ; Prescale with 2
.equ TCD_DLYPRESC_DIV4_gc = (0x02<<4)    ; Prescale with 4
.equ TCD_DLYPRESC_DIV8_gc = (0x03<<4)    ; Prescale with 8

; Delay select
.equ TCD_DLYSEL_OFF_gc = (0x00<<0)       ; No delay
.equ TCD_DLYSEL_INBLANK_gc = (0x01<<0)   ; Input blanking enabled
.equ TCD_DLYSEL_EVENT_gc = (0x02<<0)     ; Event delay enabled

; Delay trigger select
.equ TCD_DLYTRIG_CMPASET_gc = (0x00<<2)  ; Compare A set
.equ TCD_DLYTRIG_CMPACLR_gc = (0x01<<2)  ; Compare A clear
.equ TCD_DLYTRIG_CMPBSET_gc = (0x02<<2)  ; Compare B set
.equ TCD_DLYTRIG_CMPBCLR_gc = (0x03<<2)  ; Compare B clear

; Event action select
.equ TCD_ACTION_FAULT_gc = (0x00<<2)     ; Event trigger a fault
.equ TCD_ACTION_CAPTURE_gc = (0x01<<2)   ; Event trigger a fault and capture

; Event config select
.equ TCD_CFG_NEITHER_gc = (0x00<<6)      ; Neither Filter nor Asynchronous Event is enabled
.equ TCD_CFG_FILTER_gc = (0x01<<6)       ; Input Capture Noise Cancellation Filter enabled
.equ TCD_CFG_ASYNC_gc = (0x02<<6)        ; Asynchronous Event output qualification enabled

; Edge select
.equ TCD_EDGE_FALL_LOW_gc = (0x00<<4)    ; The falling edge or low level of event generates retrigger or fault action
.equ TCD_EDGE_RISE_HIGH_gc = (0x01<<4)   ; The rising edge or high level of event generates retrigger or fault action

; Input mode select
.equ TCD_INPUTMODE_NONE_gc = (0x00<<0)   ; Input has no actions
.equ TCD_INPUTMODE_JMPWAIT_gc = (0x01<<0) ; Stop output, jump to opposite compare cycle and wait
.equ TCD_INPUTMODE_EXECWAIT_gc = (0x02<<0) ; Stop output, execute opposite compare cycle and wait
.equ TCD_INPUTMODE_EXECFAULT_gc = (0x03<<0) ; stop output, execute opposite compare cycle while fault active
.equ TCD_INPUTMODE_FREQ_gc = (0x04<<0)   ; Stop all outputs, maintain frequency
.equ TCD_INPUTMODE_EXECDT_gc = (0x05<<0) ; Stop all outputs, execute dead time while fault active
.equ TCD_INPUTMODE_WAIT_gc = (0x06<<0)   ; Stop all outputs, jump to next compare cycle and wait
.equ TCD_INPUTMODE_WAITSW_gc = (0x07<<0) ; Stop all outputs, wait for software action
.equ TCD_INPUTMODE_EDGETRIG_gc = (0x08<<0) ; Stop output on edge, jump to next compare cycle
.equ TCD_INPUTMODE_EDGETRIGFREQ_gc = (0x09<<0) ; Stop output on edge, maintain frequency
.equ TCD_INPUTMODE_LVLTRIGFREQ_gc = (0x0A<<0) ; Stop output at level, maintain frequency


;*************************************************************************
;** TWI - Two-Wire Interface
;*************************************************************************

; TWI_CTRLA masks
.equ TWI_FMPEN_bm = 0x02                 ; Fast-mode Plus Enable bit mask
.equ TWI_FMPEN_bp = 1                    ; Fast-mode Plus Enable bit position
.equ TWI_SDAHOLD_gm = 0x0C               ; SDA Hold Time group mask
.equ TWI_SDAHOLD_gp = 2                  ; SDA Hold Time group position
.equ TWI_SDAHOLD_0_bm = (1<<2)           ; SDA Hold Time bit 0 mask
.equ TWI_SDAHOLD_0_bp = 2                ; SDA Hold Time bit 0 position
.equ TWI_SDAHOLD_1_bm = (1<<3)           ; SDA Hold Time bit 1 mask
.equ TWI_SDAHOLD_1_bp = 3                ; SDA Hold Time bit 1 position
.equ TWI_SDASETUP_bm = 0x10              ; SDA Setup Time bit mask
.equ TWI_SDASETUP_bp = 4                 ; SDA Setup Time bit position
.equ TWI_INPUTLVL_bm = 0x40              ; Input voltage transition level bit mask
.equ TWI_INPUTLVL_bp = 6                 ; Input voltage transition level bit position

; TWI_DUALCTRL masks
.equ TWI_ENABLE_bm = 0x01                ; Enable bit mask
.equ TWI_ENABLE_bp = 0                   ; Enable bit position
; Masks for TWI_FMPEN already defined
; Masks for TWI_SDAHOLD already defined
; Masks for TWI_INPUTLVL already defined

; TWI_DBGCTRL masks
.equ TWI_DBGRUN_bm = 0x01                ; Debug Run bit mask
.equ TWI_DBGRUN_bp = 0                   ; Debug Run bit position

; TWI_MCTRLA masks
; Masks for TWI_ENABLE already defined
.equ TWI_SMEN_bm = 0x02                  ; Smart Mode Enable bit mask
.equ TWI_SMEN_bp = 1                     ; Smart Mode Enable bit position
.equ TWI_TIMEOUT_gm = 0x0C               ; Inactive Bus Time-Out group mask
.equ TWI_TIMEOUT_gp = 2                  ; Inactive Bus Time-Out group position
.equ TWI_TIMEOUT_0_bm = (1<<2)           ; Inactive Bus Time-Out bit 0 mask
.equ TWI_TIMEOUT_0_bp = 2                ; Inactive Bus Time-Out bit 0 position
.equ TWI_TIMEOUT_1_bm = (1<<3)           ; Inactive Bus Time-Out bit 1 mask
.equ TWI_TIMEOUT_1_bp = 3                ; Inactive Bus Time-Out bit 1 position
.equ TWI_QCEN_bm = 0x10                  ; Quick Command Enable bit mask
.equ TWI_QCEN_bp = 4                     ; Quick Command Enable bit position
.equ TWI_WIEN_bm = 0x40                  ; Write Interrupt Enable bit mask
.equ TWI_WIEN_bp = 6                     ; Write Interrupt Enable bit position
.equ TWI_RIEN_bm = 0x80                  ; Read Interrupt Enable bit mask
.equ TWI_RIEN_bp = 7                     ; Read Interrupt Enable bit position

